## Pre Processing Procedure of adult dataset

In [1]:
#Importing necessary packages
import pandas as pd 
import numpy as np

### Dataframe Creation

In [23]:
# Reading the data files
with open('dataset/adult.data','r') as adult_data:
    row_data_array = adult_data.readlines()

# Creating an array to store the data by rows in order to change it to differnt columns
data_rows = []
#Arranging the data columns doing necessary splittings
for data_row in row_data_array:
    data_rows.append(data_row)

# Splitting the dataset to necessary columns
dataset_array = []
for data_row in data_rows:
    dataset_array.append(data_row.split(','))

In [25]:
# Creating the dataset_array to a pandas dataframe in order to work in future
adult_dataset = pd.DataFrame(dataset_array)

adult_dataset.head(5)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K\n
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K\n
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K\n
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K\n
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K\n

In [31]:
# Renaming the Columns with the given names in the adult.names data file to make the dataset more readable
adult_dataset.columns = ['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship','race','sex','capital-gain','capital-loss','hours-per_week','native-country','income-per-year']

# Preview after adding the data columns
adult_dataset.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per_week,native-country,income-per-year
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K\n
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K\n
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K\n
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K\n
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K\n

In [36]:
# Saving the dataframe as a csv file for future references.
adult_dataset.to_csv('dataset/adult_dataset.csv')

### Data Cleaning

##### __Null values__

In [29]:
# General Information of the dataset
adult_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32562 entries, 0 to 32561
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              32562 non-null  object
 1   workclass        32561 non-null  object
 2   fnlwgt           32561 non-null  object
 3   education        32561 non-null  object
 4   education-num    32561 non-null  object
 5   marital-status   32561 non-null  object
 6   occupation       32561 non-null  object
 7   relationship     32561 non-null  object
 8   race             32561 non-null  object
 9   sex              32561 non-null  object
 10  capital-gain     32561 non-null  object
 11  capital-loss     32561 non-null  object
 12  hours-per_week   32561 non-null  object
 13  native-country   32561 non-null  object
 14  income-per-year  32561 non-null  object
dtypes: object(15)
memory usage: 3.7+ MB

 To the above observation there is no null values in the dataset. Therefore __no need to fill__ the __null values__ in this dataset. Also we can observe that all the Data type of this dataset in object type.

##### Duplicate values

In [35]:
## Finding duplicate values in the dataset.
print(adult_dataset[adult_dataset.duplicated()])

      age          workclass   fnlwgt      education education-num  \
4881   25            Private   308144      Bachelors            13
5104   90            Private    52386   Some-college            10
9171   21            Private   250051   Some-college            10
11631  20            Private   107658   Some-college            10
13084  25            Private   195994        1st-4th             2
15059  21            Private   243368      Preschool             1
17040  46            Private   173243        HS-grad             9
18555  30            Private   144593        HS-grad             9
18698  19            Private    97261        HS-grad             9
21318  19            Private   138153   Some-college            10
21490  19            Private   146679   Some-college            10
21875  49            Private    31267        7th-8th             4
22300  25            Private   195994        1st-4th             2
22367  44            Private   367749      Bachelors            13
22494  49   Self-emp-not-inc    43479   Some-college            10
25872  23            Private   240137        5th-6th             3
26313  28            Private   274679        Masters            14
28230  27            Private   255582        HS-grad             9
28522  42            Private   204235   Some-college            10
28846  39            Private    30916        HS-grad             9
29157  38            Private   207202        HS-grad             9
30845  46            Private   133616   Some-college            10
31993  19            Private   251579   Some-college            10
32404  35            Private   379959        HS-grad             9

            marital-status          occupation    relationship  \
4881         Never-married        Craft-repair   Not-in-family
5104         Never-married       Other-service   Not-in-family
9171         Never-married      Prof-specialty       Own-child
11631        Never-married        Tech-support   Not-in-family
13084        Never-married     Priv-house-serv   Not-in-family
15059        Never-married     Farming-fishing   Not-in-family
17040   Married-civ-spouse        Craft-repair         Husband
18555        Never-married       Other-service   Not-in-family
18698        Never-married     Farming-fishing   Not-in-family
21318        Never-married        Adm-clerical       Own-child
21490        Never-married     Exec-managerial       Own-child
21875   Married-civ-spouse        Craft-repair         Husband
22300        Never-married     Priv-house-serv   Not-in-family
22367        Never-married      Prof-specialty   Not-in-family
22494   Married-civ-spouse        Craft-repair         Husband
25872        Never-married   Handlers-cleaners   Not-in-family
26313        Never-married      Prof-specialty   Not-in-family
28230        Never-married   Machine-op-inspct   Not-in-family
28522   Married-civ-spouse      Prof-specialty         Husband
28846   Married-civ-spouse        Craft-repair         Husband
29157   Married-civ-spouse   Machine-op-inspct         Husband
30845             Divorced        Adm-clerical       Unmarried
31993        Never-married       Other-service       Own-child
32404             Divorced       Other-service   Not-in-family

                      race      sex capital-gain capital-loss hours-per_week  \
4881                 White     Male            0            0             40
5104    Asian-Pac-Islander     Male            0            0             35
9171                 White   Female            0            0             10
11631                White   Female            0            0             10
13084                White   Female            0            0             40
15059                White     Male            0            0             50
17040                White     Male            0            0             40
18555                Black     Male            0            0             40
18698                White     Male            0            0             40
21318                White   Female            0            0             10
21490                Black     Male            0            0             30
21875                White     Male            0            0             40
22300                White   Female            0            0             40
22367                White   Female            0            0             45
22494                White     Male            0            0             40
25872                White     Male            0            0             55
26313                White     Male            0            0             50
28230                White   Female            0            0             40
28522                White     Male            0            0             40
28846                White     Male            0            0             40
29157                White     Male            0            0             48
30845                White   Female            0            0             40
31993                White     Male            0            0             14
32404                White   Female            0            0             40

       native-country income-per-year
4881           Mexico         <=50K\n
5104    United-States         <=50K\n
9171    United-States         <=50K\n
11631   United-States         <=50K\n
13084       Guatemala         <=50K\n
15059          Mexico         <=50K\n
17040   United-States         <=50K\n
18555               ?         <=50K\n
18698   United-States         <=50K\n
21318   United-States         <=50K\n
21490   United-States         <=50K\n
21875   United-States         <=50K\n
22300       Guatemala         <=50K\n
22367          Mexico         <=50K\n
22494   United-States         <=50K\n
25872          Mexico         <=50K\n
26313   United-States         <=50K\n
28230   United-States         <=50K\n
28522   United-States          >50K\n
28846   United-States         <=50K\n
29157   United-States          >50K\n
30845   United-States         <=50K\n
31993   United-States         <=50K\n
32404   United-States         <=50K\n

There are some ___duplicated rows___ in the dataset. So let's get rid of them.

In [38]:
# Removing the duplicate rows in the dataset.
adult_dataset = adult_dataset.drop_duplicates()

# Printing the duplicates again in order to finnalized that the dataset get rid of duplicate values.
print(adult_dataset[adult_dataset.duplicated()])

Empty DataFrame
Columns: [age, workclass, fnlwgt, education, education-num, marital-status, occupation, relationship, race, sex, capital-gain, capital-loss, hours-per_week, native-country, income-per-year]
Index: []

Now the dataset has __no duplicate values__.

In [ ]:
# Checking for structural errors in Dataset.